<S>
</S>
<UNK>
21224
8197
15274
7664
7706
4246
19311
14123
12772
12617
1027
3948
16512
21097
10925
11123
19421
4846
4216
159
3166
6102
2699
9391
10789
7384
18826
16046
5163
17219
17145
16496
17597
13751
15822
2128
2289
20027
16712
17186
2819
18538
19006
5025
11255
2034
20451
9779
4859
20583
14126
20359
17681
3452
17166
12062
15345
14937
4104
14077
13513
6754
10609
3445
2379
10341
13670
13552
14091
16201
20170
20743
19215
1856
14477
6967
17565
20620
3253
8649
14459
3009
13494
17325
16980
15020
16806
567
4106
1961
13781
20958
2969
3277
20859
954
19365
18158
2649
19184
11664
12943
13519
1886
11642
14747
4921
882
6006
6196
19285
14812
4718
6303
13553
9088
17225
16805
1668
3988
9906
3545
4779
11188
6254
6642
6112
5863
1847
17592
13862
10092
17083
1819
16374
15426
7938
7747
16688
4688
18199
8387
7106
7649
15788
9007
8487
10223
19936
586
533
6000
3647
15556
20813
18571
14360
12302
10037
14499
13614
16419
16929
968
7047
14244
15060
13309
13426
16113
2240
8217
6051
19675
16654
2658
11033
15785
7379
3380
19934
9954
2250
2003
12172
14478
6437
17808
9732
16435
12851
5379
15140
10072
15034
9199
5808
17337
19258
19425
7501
7251
20815
4387
9887
8379
3424
11806
7105
14978
20279
6991
19832
17427
20600
13487
6478
19638
8064
19453
15582
19851
12610
14199
8373
11122
1965
5759
8617
17964
17348
12751
6625
13940
46
14253
5190
3133
400
10158
17304
18736
4929
20573
17667
4935
17370
16362
1173
3191
2483
16546
5391
9005
10627
11581
10512
5870
11167
8505
695
7438
14132
20808
7230
1223
16979
10571
3061
3083
17622
11972
2557
19302
3028
17759
18705
11685
12607
18802
2680
927
17047
4703
10841
18799
19616
10455
4223
6891
6312
6299
2797
19061
15718
14498
9701
5026
9433
15492
11103
15762
7990
2643
297
8489
4758
3738
4954
4190
10690
13248
14640
8344
19877
5985
6522
18053
19120
4808
23
4948
10920
875
511
13529
5626
10399
19864
16816
11068
19356
2702
18288
9211
16327
10870
19853
13046
15692
8572
3999
2771
9187
11924
20544
10777
3809
1353
10332
10536
1488
5908
5810
15212
11743
1519
14675
974
9460
4886
2161
8885
14346
13664
17457
5930
14033
2896
18496
18620
497
4243
9679
11331
14358
12266
8038
4077
6484
17624
6306
14277
17600
11735
13821
15964
17359
5390
8952
17732
9267
11746
4616
6384
11543
20201
204
13159
16885
16498
2041
18173
13129
15287
1984
3047
13170
4244
14582
15372
16623
13317
17516
6181
17789
10516
21145
6858
12333
6255
19529
709
9942
18094
659
6733
861
1866
12911
7040
2764
537
8041
15462
21125
14722
9442
12540
962
15712
13040
286
10903
4513
15033
17126
6258
4840
4988
8467
7380
18952
2869
12721
7420
6471
5368
20129
9350
13146
10938
20148
18282
6600
4581
5736
19127
14790
4750
19534
19907
4570
7020
11384
6623
15041
10270
19172
18038
14867
1514
14803
6353
58
11996
13696
971
20048
18016
18660
18781
19315
5966
2849
2438
5635
19543
14658
3441
14564
17031
17532
5616
8715
14286
17159
2641
17735
14422
15655
13924
16077
1457
9860
16093
7069
2256
8808
13968
8428
6164
21131
162
6201
11249
18102
15799
6068
4204
19828
12252
3248
17506
6682
14169
17409
11553
9233
9180
10869
12469
20611
4250
15574
9254
11990
21115
10619
2432
9312
9186
13004
11043
1801
7917
3510
9629
17831
7199
4275
2242
20684
5557
13711
16369
17773
7942
1250
5815
3421
19752
5797
18057
6329
9499
11378
13550
18732
9089
160
3768
9933
708
1939
18059
5332
12164
18850
20790
6594
16288
768
14796
8141
11530
10247
5018
19429
8354
12093
4864
7659
9452
7769
9481
5156
6042
6135
14313
4350
15324
10763
17281
19952
8112
21195
6574
632
12788
12299
4211
6463
689
10083
17000
17939
18103
19987
14903
15428
19234
19200
3323
11329
20588
19247
19536
4034
19181
15838
17851
14839
6040
8077
3486
1032
20667
2709
6523
4967
11385
132
17909
1911
8523
3625
18097
3267
11367
19134
11499
5067
14523
19415
7432
7523
15920
17712
9473
10075
10520
20440
14784
18056
6174
19807
14815
10729
9001
16217
15950
7007
20168
1784
19229
4273
8551
19977
9220
19224
3967
3935
4191
18100
17136
15913
16722
5008
6997
5157
8110
14949
10427
20365
19092
17834
17682
18341
634
2485
8691
20470
416
15259
3976
7096
7232
12985
10229
4089
16254
5852
16687
16108
8179
304
11605
2273
20224
3862
6839
2457
18958
10965
9576
19618
7994
10432
18659
7700
13544
4526
21178
700
7629
2830
16222
15671
6225
20449
19813
8806
11099
7820
20284
2984
18928
19735
12643
8868
1827
15915
20138
17488
7529
3786
11431
18430
15699
5724
17885
717
1166
1215
1269
6601
9479
635
1581
9405
2729
11310
9401
9675
4183
19074
2203
12664
10545
10803
19592
19808
5848
11133
10063
3868
14723
16873
9921
18641
10765
8325
11622
9079
12992
9361
2696
10141
16110
20372
16718
959
16789
8317
19204
16948
6086
16195
17705
15673
16906
19776
18535
1769
13789
4487
14642
13280
13843
21215
14854
10524
4167
1625
18393
3249
2974
1884
3157
1749
6005
4163
10352
7593
9685
14350
9298
4114
983
3134
13593
16105
3888
20411
17475
16357
8814
20827
16872
6706
15874
20691
14039
7995
4615
984
15193
12488
2568
2422
14481
3007
12307
3343
20312
20247
16993
20035
13014
13623
5457
17104
8584
15898
11934
3970
15294
12666
6092
1033
11487
4528
9910
7731
12082
14320
7518
18318
9409
6850
9221
6930
13092
10000
18988
20310
16550
5717
20869
14085
11505
20725
1043
2513
2276
17019
10013
8640
336
2361
12884
15025
13480
7411
241
1059
21141
19716
16138
2051
6130
13135
7647
18699
10800
13002
18971
7605
19665
8907
14684
6036
10850
14908
16730
964
957
14002
15709
11250
9655
18771
12850
18372
19214
3981
16449
8746
4530
15612
581
2492
18403
18128
897
16679
13514
7859
4598
3454
4091
9249
3468
5540
19570
16957
18347
5647
19370
17797
19823
18101
12193
14461
8738
14714
10962
10134
18962
3872
11541
14196
13851
2473
1969
3431
15669
12256
15465
7111
21023
10951
16468
16879
13534
670
890
1966
3722
11689
13221
3682
17765
14464
8033
10671
7684
18113
6093
11702
3669
20821
9068
12474
10226
6422
19316
11679
12052
18593
16908
9730
21163
20733
4218
1595
13964
3642
18241
6710
20732
16149
12659
15468
4509
20849
9234
18474
19024
5918
6229
19479
16820
538
13767
18830
15594
11652
8358
6816
3310
17606
16199
1432
1274
31
12083
12228
17441
10890
1898
17998
18968
9070
5711
18541
17430
787
3662
14971
8891
8743
9435
18222
12502
6443
10272
1278
11727
1910
5564
2801
15978
15596
15580
2604
9901
16866
12518
5323
2052
10293
4893
16341
2687
16061
11927
10575
4150
10985
14309
12080
15682
1146
18330
6018
7755
11276
14428
21052
2668
10053
19976
8333
8122
10249
2008
19916
2135
11557
19222
6060
6088
4140
5227
10754
9661
12541
11198
7255
19741
9741
17228
7377
5718
12324
2402
364
19517
357
15833
1511
21035
9056
8792
7272
8014
4939
2997
19890
2076
2881
3621
942
18227
11309
1727
21209
9279
11612
16075
21155
3596
20298
10720
11185
6662
1702
18521
11196
1260
607
356
9683
9717
8772
12797
21082
5330
7236
11634
10940
542
18485
1308
10699
14673
13010
19552
8637
3591
7672
20707
4229
15629
1530
10706
17363
18941
5779
5470
15111
378
3219
6736
1046
14930
4517
21046
4545
16073
8601
14383
18551
6540
1016
11300
14146
11352
7941
11656
2573
4767
13333
3568
10807
9327
1054
17220
17813
15227
9600
2083
10355
3500
10537
16784
5857
12550
8154
17956
2822
9196
3122
13582
685
16710
15260
20172
6610
4432
13680
10589
18894
8789
19090
4481
75
234
5537
20380
20393
4875
15567
11659
8337
9443
17296
8456
13966
4903
10204
17691
19041
5844
3268
11865
9697
4493
11221
10259
4271
1639
5884
6916
15293
20901
2525
15349
1598
13266
15758
21025
6003
11298
15828
20426
12470
17863
18054
8794
6765
21117
4088
5861
5767
17389
10886
7802
4200
11277
11061
20353
19174
6057
2625
16534
9253
1942
12076
12294
10240
4720
10532
13549
6919
3043
11407
10450
200
11882
7427
11230
16653
15836
14205
6519
4797
19629
13449
1815
7104
5188
10865
9178
3295
18487
4685
1368
10997
17634
15163
18577
10100
8913
11476
3873
14119
5172
18574
19759
2508
17320
9772
6013
9422
10686
14270
18425
10393
20124
13667
6156
17850
14303
6677
5687
9418
16535
14063
17114
3341
8316
14862
5475
11334
12057
5885
16312
453
19654
20507
5013
9463
9865
8893
15074
19457
17899
13753
14840
12253
7571
417
17473
13565
12241
19786
16773
16655
16086
13503
16032
15210
6724
11945
9067
2664
12026
8734
19792
7982
6803
10635
15875
18782
12622
9770
11860
7805
12936
16010
1660
3024
3069
16262
19520
21152
15004
3893
10957
8883
15352
7448
20717
14868
13085
15100
12757
1716
4166
11755
11773
2087
12141
16709
10815
17820
19354
17996
3652
16585
7212
20795
11922
17040
6148
14632
1719
1893
7118
18448
3778
3620
5424
18212
10339
20464
19766
16150
17514
14977
5850
18780
13358
18250
20354
17154
19955
440
14059
9552
8608
4938
1309
19972
17559
734
8289
8732
3940
19794
12257
5312
1354
10511
17456
192
4830
9718
7344
2396
7270
4149
7012
13706
9167
18004
14537
15997
9674
68
3660
15899
17405
8194
16456
152
15138
18005
8397
16643
20955
6507
772
3576
18126
20518
12508
19707
10376
755
3871
19375
2812
17005
9590
18202
20238
7139
9596
18205
9810
11784
13034
13758
715
20350
16367
16228
14250
8231
16951
13573
21168
4169
5665
7726
20268
14530
16876
14738
123
4682
17204
16243
10504
19443
16109
4925
5871
11470
2948
18740
7217
18811
270
6608
13669
12983
21086
13634
3889
6023
3027
19626
20400
8554
7248
16225
11645
15744
3533
19206
980
7244
15493
11421
5076
4096
14576
16470
18652
17274
19705
19286
15198
1571
13278
8081
10868
16574
5949
1366
19962
16853
6186
17453
6235
7545
19133
17305
1169
10922
9396
20730
8331
11910
15491
9322
20627
20755
13139
15449
19474
13087
10847
7356
19896
18996
16328
17392
20884
13918
18333
19465
8884
4060
18677
7735
16068
4264
6756
289
18837
12505
17807
16614
832
4119
12561
10562
3641
16541
9825
18597
10463
839
19220
4294
14843
5185
19209
8624
20158
10051
18764
6393
6835
13938
11498
10531
585
5155
10689
880
15994
18194
12755
9657
2578
691
18389
2772
17023
13262
18570
7081
1202
8949
9688
1424
19291
7707
18443
19113
16284
1751
19852
6741
7495
16127
4125
9799
18872
1944
7035
16294
3875
18829
7679
5477
13817
11555
7762
16509
9968
18693
10078
9307
9763
12394
8771
5092
7665
13324
16769
8415
9987
12305
9269
10696
13300
18080
2297
16889
10121
2863
16305
13425
20537
15495
17878
2104
5276
20478
14397
19734
19431
15782
18932
13717
9998
8993
11340
5940
15862
12844
2543
6033
17253
13470
2238
5365
3105
17629
13396
781
14778
19643
13682
15595
5269
8529
4815
7009
13931
2569
19961
6072
13906
15362
130
13406
938
1567
3199
20119
17271
17388
20192
14621
19337
4112
18695
1188
8147
12111
6365
20503
16622
422
4288
3906
5523
15116
15851
2632
14913
1705
12766
9344
7640
2066
13395
9027
5175
17591
4659
20982
8926
2996
2924
6666
17444
21042
13116
13173
16720
18498
3752
16074
13742
21208
20923
16664
4725
5296
7142
10563
14864
17602
9343
15944
13994
10387
9308
21120
9022
11415
6911
20972
7391
2715
16864
8370
11919
7549
4757
5112
19237
18475
6134
6653
18572
20137
11253
15182
6286
8347
10975
7080
8950
19138
13193
18391
3785
21182
3895
12520
16839
13124
5688
1869
327
14236
19
4555
3251
8324
18045
20692
16407
1531
277
9423
16394
6417
7053
20909
2503
5480
7897
20347
11350
1539
4032
3182
15105
20970
7552
13298
7268
10447
15951
15900
5028
11774
354
5342
6772
11770
2640
7912
20522
4613
814
12360
2686
7
4932
11646
257
13321
10866
14403
13989
10179
9286
6491
6291
9876
9909
20067
20401
7573
933
10894
20024
18127
3073
13546
7677
17252
19803
8533
14770
12157
18882
5639
10645
20992
16163
4931
2108
20235
18437
19282
18658
14051
18262
4873
11489
2036
11586
4057
595
9215
17775
15042
17638
17064
2086
15097
2089
6596
629
18973
3137
19283
5348
15666
1611
3861
15681
14488
15893
8853
19180
3110
16275
13460
6635
15897
13957
10325
2912
462
13218
16849
17949
18131
3119
17070
13728
9577
5003
16166
20759
1708
15541
1426
17057
13916
19560
944
14501
5745
1885
4473
2095
10467
1097
14848
14271
4648
4531
19863
10872
14985
16285
12566
9171
15166
20456
15172
5953
10845
9780
2411
6456
16800
13597
10459
6603
20333
4376
2213
3937
13152
19732
2554
8363
20833
19066
774
7388
1852
17408
11
5201
7133
14519
15340
11964
19527
13956
9488
17870
11787
14834
17168
10337
4122
1330
13194
7979
1474
17090
8881
18319
9689
10936
5444
5510
20441
20513
17178
3167
6649
6109
21172
8819
4819
13803
14094
20572
20519
10461
12162
14752
2738
10673
19632
20226
10557
8575
12184
16694
2219
11944
4563
16961
5599
16377
5543
16955
5743
19026
9698
3383
10374
7666
13420
20351
13198
3991
18562
17992
6142
10012
11292
14222
1642
9119
4772
19607
3910
8707
10565
477
143
3740
9861
7508
20830
10839
11946
17523
16263
15283
21106
17068
10126
11183
19019
9525
17198
6212
2253
12049
20907
18301
20580
16308
12596
17632
12369
3296
3302
20549
1841
5440
11080
8936
14545
807
20206
15511
17685
14764
16
17756
11439
14246
4752
3963
11556
14698
3859
5517
1636
4557
5818
12750
11531
2535
5917
15402
7214
4923
2171
12454
16057
7786
10943
10318
18986
16682
11684
1208
15878
16214
18954
20688
2836
12839
7563
12682
10019
6081
2321
1725
12036
9948
2413
5374
5592
17510
16015
20931
18924
6829
20200
19994
4664
2978
11303
17783
21009
19696
6634
4972
7070
1881
12448
14691
10243
6116
2656
8208
11211
19910
4382
17237
3288
15174
16335
9581
14285
14589
19964
12903
14744
4764
10707
7313
19481
19624
17190
8148
14873
7253
14745
12378
13925
15516
11391
4804
15305
4022
11874
6376
19189
16745
20935
2445
16331
5264
17572
8083
1687
9498
5359
9624
13451
13016
8536
9354
20059
18675
17731
2450
10197
17194
7190
12287
3748
8618
7326
7974
10600
19554
4095
6752
9275
5782
2824
10492
17010
18332
11825
12727
12734
13907
19599
4860
9635
12175
1020
1569
9504
8730
16648
20932
8726
15269
9389
14592
11824
14294
13947
14773
17798
11101
2078
18772
15313
2403
8120
6595
0
14912
6205
16795
10933
8423
15036
4081
404
9882
19604
12521
19749
8219
838
3213
4121
10559
19423
20983
2663
11842
16692
1584
452
20965
9182
15110
17955
19112
19773
19023
3391
311
17391
1840
16568
15153
4853
10190
3456
7307
13416
17407
9444
13596
16703
12455
10149
11588
9427
19139
15220
13610
15469
1517
1587
17215
20953
17684
17972
13979
9485
19841
11332
20097
11341
8900
11895
12592
3274
19013
2012
4015
15956
17744
14149
19548
1958
8856
4866
3840
16481
7579
6824
8005
3538
3178
2200
19532
19310
3286
6128
16151
7318
16949
15537
146
9170
8116
7152
10362
11000
5636
5082
1479
13154
2212
2821
6778
8458
9595
10163
18216
11978
12814
3842
13967
19540
13008
9329
3715
16612
3125
16748
20111
16177
15312
1460
21166
7748
20194
4427
18833
21213
13370
4263
12006
10105
15217
6119
19758
9690
19233
9970
13616
6497
18655
18976
18088
8988
21122
2654
19706
18913
16495
1947
16337
18137
9202
5086
20863
20694
2850
4881
12425
836
13238
14615
21105
4811
19695
928
18627
14327
20143
8498
12981
8965
5243
10613
812
17513
19998
11137
9997
19593
5340
15896
13935
2970
19755
21048
5976
8205
15002
3094
4046
19167
11266
11020
14651
12317
9619
11202
12358
1661
5490
13618
11647
16875
1357
14931
10437
346
7444
20152
20777
6315
8107
6811
6380
4103
7461
6712
16508
10794
1665
9788
4956
16211
10435
641
19144
20788
4308
15880
20016
20650
8048
14405
4303
15275
17900
18861
6943
13718
4070
17130
989
8663
13175
19178
13429
11640
3197
6173
3676
5232
1825
7918
12644
17933
11715
1100
2762
2977
2293
5050
8269
4253
21222
12087
13659
6849
9150
5116
19523
11021
18415
17577
9548
10142
4713
3624
14765
12924
10521
2998
14644
3208
16783
10982
13404
4968
3433
9538
14291
1837
2320
11962
21188
14547
17524
18230
19655
4400
20735
3776
3152
19724
14308
11062
19771
12562
11001
11090
52
13265
8756
20709
5202
19958
11092
7855
8696
1635
12053
3823
1006
8361
9556
12514
14571
14471
10640
19460
20207
6428
12430
8389
14340
21085
2415
10299
13780
7516
7543
18082
11884
12587
747
14099
15903
18537
9927
604
16445
8692
6707
6760
20721
9592
18246
9169
13772
4653
2677
1086
6913
18506
10312
16750
7929
16901
16196
16317
19729
16469
8374
12971
15695
8908
15635
6886
18643
16553
883
10921
19817
15801
11902
19221
13563
9316
20614
4076
9006
18818
206
1151
5672
16632
19742
3301
7585
19810
19152
18098
14213
16404
2369
9890
9368
15005
2742
12011
19920
20144
18752
15282
3353
14588
261
20256
5047
504
1096
6872
20677
4113
11791
4973
9155
4349
20063
19420
4234
17809
4024
3008
17485
16139
381
15214
20645
514
1651
11007
6047
745
228
3281
14198
1922
12054
19025
6823
20011
15139
17280
7116
16478
17315
20171
5716
1244
18898
4451
15271
3099
2803
13458
14801
12020
16763
13231
21060
2115
4870
3029
3615
7757
11336
11799
17708
13778
1747
8051
13890
9833
14685
1115
9093
7435
11449
6815
14727
3162
4879
18225
19329
4538
16123
13761
3390
10759
9870
18723
15985
3374
5006
19231
14731
14711
18580
18427
3244
8345
14080
5135
20528
6676
11457
17594
12319
18114
15982
4415
11807
18859
11228
1218
10702
5507
16578
18378
15236
10745
2286
20068
3683
1564
15663
16143
7646
3918
16792
19887
7660
6695
19449
9477
12957
10379
12063
16231
11314
19288
149
259
39
9325
12268
1811
16818
17767
18079
9071
6421
9428
4665
14036
7827
15557
12348
12154
393
7178
10636
19692
11516
5283
13681
18949
12652
892
8972
4794
10831
5314
1038
12311
15623
7387
10410
8042
7336
9065
9207
10222
17445
14634
16545
2006
17742
4735
11119
18540
6302
10651
21196
15863
17770
17908
17902
6069
7908
13062
11269
5254
3631
16096
6431
7988
11051
9710
13125
14579
5625
18375
19484
14533
8760
20317
20425
19448
8053
16528
486
19245
13028
990
13151
8933
4375
4290
1504
20085
8515
2409
14089
14583
1475
1050
1277
9739
13580
1148
11802
18816
7673
21028
9863
2154
9084
20621
13386
18071
8720
3297
2979
7894
5843
9004
19072
11469
7314
12421
17149
14817
1580
18703
5117
4027
3461
2045
6742
11814
17719
8227
7328
4274
16749
10007
13106
12116
12363
10820
4352
13905
3400
10106
8390
20625
14220
18845
14490
19182
16629
16250
20608
17127
18530
922
12532
1389
20811
966
8012
11134
3726
14072
1209
11692
17702
8962
6905
765
2817
8683
15142
1117
6435
10004
15476
15752
13393
15228
15257
18317
18904
9762
810
18295
8332
8703
1521
11843
17884
19835
11995
941
10823
17976
8671
9297
7688
19475
89
4736
608
12663
9992
6766
6571
4355
3645
15779
14206
366
16702
9540
2127
20038
111
12542
5147
8114
5356
4153
9914
4391
14608
13704
6570
17593
17009
7843
10756
16162
12690
19433
18388
14357
2130
6716
19411
18069
13247
4519
17414
20973
8799
17857
8085
7250
5204
15531
10333
12848
3757
17794
10714
15789
2556
12108
9472
17556
19230
3498
1551
6974
16033
13798
13934
5287
16160
7970
15837
2195
13662
17613
6944
18805
12015
6779
8228
13183
1009
9783
8495
3640
9294
10685
9622
10239
6202
12503
3603
20646
7709
9749
728
18083
4354
4789
18163
18777
20272
15586
8906
568
12048
19305
3156
713
18795
14135
2268
435
11144
17618
7179
4512
3916
6176
19455
15464
6927
139
8497
5208
11864
769
12608
3658
13922
14278
3828
8322
20028
213
5931
17200
3521
11451
10129
10185
19882
11453
15806
15924
12270
11330
3331
9643
11838
13594
19444
20662
9847
2938
19333
15407
20630
13560
1877
9613
14079
12563
6441
10638
12665
2867
10895
4178
1325
10711
3255
20729
10899
3266
12431
16790
454
10634
5565
11145
9569
12214
18479
5125
20964
12944
6483
13033
11410
21070
13762
2674
13615
20946
19717
13813
18486
19997
10590
16581
3034
12055
3006
14916
18214
1761
8980
9319
10382
11339
18099
731
15218
6689
9835
5317
20431
8676
10064
1777
4841
4805
13531
15039
20136
5534
20415
5597
13384
6802
20719
17790
1133
12126
407
10359
4010
722
14733
16995
15248
12908
11920
15938
20601
5573
8210
1618
3443
694
11078
9232
20570
11867
2196
20708
6865
8903
7796
16128
9390
17542
11584
911
11670
6793
3434
20786
13055
12269
17434
14833
15739
16542
11601
8481
7522
7849
2530
5859
8796
2705
20349
9347
15310
3070
8504
15343
16095
4116
2528
12312
1832
19440
13526
2724
8226
7407
12965
14825
10071
14387
7951
6960
11655
12061
6386
19469
3211
19141
11595
4260
19503
19973
905
7833
11374
3759
13509
15064
16323
20532
4048
13578
9080
2226
11461
15784
557
3426
20328
18961
12701
9445
16197
5010
14877
15276
9549
3415
8753
2893
99
15572
7550
13633
9745
5532
20164
127
2895
3863
8786
5194
10495
5875
9135
5417
5699
8367
19242
9649
319
18140
5964
3968
14190
5881
8494
13260
8298
4680
8381
20774
8834
13695
4110
15455
1501
18136
16488
19244
1724
14041
9448
2173
16378
8644
3059
17469
5399
4917
1940
541
21006
6705
13035
11629
12553
15767
1259
449
12462
18827
16340
8024
15714
6095
17507
11899
10470
5960
17846
12156
2524
19238
1326
10956
8267
15958
12350
11529
17837
56
18168
4258
12860
9338
639
5801
9641
17855
15232
8943
12878
5495
9962
11338
17944
19840
17134
12405
11414
14317
12507
11512
17701
6362
19467
17581
17066
554
6931
15719
19943
18361
1846
18012
19684
2469
826
12449
889
4278
2251
4806
7831
4800
18647
4577
20357
14660
9285
6145
7592
2446
6652
3275
15939
1809
17476
6395
11399
16315
13029
17026
5345
7487
15725
18135
21083
14883
16439
6446
13134
1083
20128
8687
8271
3316
17336
18346
601
54
175
12728
5685
12792
2278
19404
17835
2722
778
20424
21211
19001
18147
13122
2306
2142
16349
7219
1775
21171
4443
2733
2693
18460
19600
2628
15590
4093
8011
5187
17665
16272
12791
7782
6578
7598
17824
13250
18839
13153
14988
2670
15073
15154
2673
27
7765
10394
11441
2295
14741
4173
9977
1114
3949
11219
11520
12286
18800
11731
6270
3335
11220
14759
12393
4916
386
20381
15773
17776
16427
4990
1497
7811
19690
14981
11130
3795
18880
20182
4460
19268
15821
11658
19859
955
13367
15934
16261
18586
4309
11830
5518
697
16762
4280
1844
14221
11296
15583
11861
3573
7041
2889
3590
12075
18264
5657
18788
18583
94
16099
11870
8831
5632
15716
1887
19913
8650
11943
8983
5228
19723
7830
2597
18754
13972
12527
9457
12641
3801
7689
7864
1186
4181
17124
17898
19059
11940
9953
12937
18993
1669
9030
7535
14084
19232
4715
2356
7366
1082
16185
7367
10273
9203
12658
1280
7302
3384
12726
6021
11669
10040
4559
1205
4820
1423
8301
1620
16373
3837
7229
15984
17966
14174
16213
4041
865
17369
5422
11473
8598
2511
6004
10515
10345
12066
20769
4357
18018
11708
20049
17352
10206
1387
16193
2062
15285
14739
18922
15199
9946
15364
20910
12718
20240
13849
14876
16649
18794
7538
13316
12735
13562
13794
17730
15962
7237
4518
15192
157
4329
3153
9495
7443
15676
12433
5730
10342
3405
2723
1520
7410
17424
13376
642
12602
2616
16757
5904
7264
12646
13952
14577
8565
7652
8134
8712
19438
7114
18220
3140
1786
10796
1615
19568
19018
14552
5474
13545
15693
9980
14082
9192
13318
14511
598
14029
10534
15710
10960
10859
19186
20495
2844
19115
16735
6106
1241
2153
17374
15379
8260
145
18979
15879
18178
5324
5186
5862
3531
2302
1690
195
9147
20157
19870
7298
6406
17999
15811
20339
10809
2560
16704
10821
12388
14071
17540
14641
15771
6233
16420
15605
1302
6547
18122
3496
13814
8520
405
4235
6228
6890
1002
9578
19516
16090
2825
16270
14074
18242
3240
12828
6246
11760
17943
11720
9055
17079
20218
6150
4177
4002
14121
71
12404
1664
7754
17355
794
2545
6010
10074
1421
21133
2080
2648
3710
2960
2331
12629
10668
9296
821
3095
1227
20517
13412
3537
10558
14379
1154
16698
18564
10655
13709
18930
15802
18259
6750
13646
21197
20165
2595
8791
5766
20293
7417
1074
1225
2493
10540
3215
8969
19885
20919
7025
12016
11561
15022
4701
19634
6553
16204
11949
20942
14857
18713
17969
1172
12419
16693
10932
19000
14729
10510
2790
16941
11891
16886
15869
10998
14388
14692
4625
3607
15092
16236
5750
11102
4064
12273
18522
12875
13987
10880
15857
15653
19147
10682
9509
15189
15861
15381
20695
14958
17539
7258
3674
7678
18254
5288
20911
13127
18532
467
135
3601
16669
9468
4849
16156
2134
20253
16014
17139
10852
17181
16921
2229
17410
13381
20385
3665
4536
2787
11162
860
13927
19060
4549
13645
12490
8564
20147
8606
1081
2707
16747
16307
10278
6432
11913
10856
2308
21186
9758
8234
15307
13497
9385
15895
5748
7986
9791
9897
7304
4085
11984
13963
8635
11156
10307
14344
725
19601
13846
21037
205
5246
3556
2792
14774
565
8643
12880
18888
5080
10096
20857
8978
13264
20023
6257
15035
8665
3246
8399
8781
104
12284
3604
14011
11747
16266
3899
17400
9790
820
15966
4986
8858
17203
5141
3072
21174
7315
5341
10818
16352
13320
15149
19153
8187
15272
9241
5957
6936
14497
12446
7555
12765
14814
14609
4896
478
19989
4186
864
10966
20599
20327
20295
7386
16549
9566
475
15496
15505
12815
12988
179
9035
15835
8704
4978
15120
10360
13715
18747
15346
19925
13192
18918
8350
8735
11801
13294
17822
7046
107
4857
888
12683
13970
3891
16616
9040
16287
13423
10289
18291
7373
17053
8977
15917
20212
4136
1823
15441
12090
8882
7890
18504
3349
7286
9130
4671
6307
9377
1667
1203
1499
9820
344
10611
5375
2022
8869
7021
18947
17829
18167
5081
1774
14763
19299
770
19255
11998
19493
2676
13230
10934
2452
15016
11164
8522
7119
9960
20370
981
17042
11651
11348
172
11563
17658
6083
6787
19796
16582
17165
18688
1273
4821
5693
2221
1872
20682
5719
6654
6573
14911
1183
19804
20281
4038
2544
1222
5410
15266
11229
4276
16791
13559
5621
9489
3725
12456
12818
7846
16359
19862
14161
3163
3488
1700
7783
3170
4763
1226
19981
14106
5578
10950
3091
5525
7914
19661
12614
1589
14900
1882
16460
17603
932
13001
8697
4998
3599
12402
16499
12301
4058
18058
1950
19797
3789
14920
5151
18256
14086
19546
19410
12390
16758
2925
4697
11402
19207
6065
17766
17517
4497
6188
1518
7134
11929
13083
2521
12224
13630
16135
9636
15311
1772
16208
20892
6198
12397
16668
9687
12645
17191
8008
8545
14993
114
3483
16576
9573
4133
13884
5795
17174
1400
4344
4635
12194
16910
10157
14832
12285
2103
742
1614
18685
5559
17421
9796
1026
12675
18650
13722
707
3802
14897
15960
6442
21032
13432
2098
18040
11316
284
10305
5063
4551
16031
19057
5472
8376
19645
15219
9455
19511
8961
9470
2138
12777
6454
1821
20738
21147
10801
11070
5313
20096
851
20548
3464
4527
13475
14945
9049
1796
8970
2263
5062
5209
19321
11823
7617
17875
6400
18081
5921
4599
12929
16006
5983
3883
12879
7874
15957
11151
350
12512
13611
8262
17795
19422
1641
9388
20276
3934
5461
1393
3882
14168
19579
9904
764
15412
1315
2351
13836
15499
7097
1283
3770
5064
19028
15490
14611
6058
2697
4161
8512
19205
4987
9274
5681
8525
4636
11604
4964
924
7958
18792
3854
10460
10139
8182
9801
16809
1634
12391
8119
4946
15741
10196
1351
8192
2215
1206
8121
8909
7222
17903
7204
801
13197
18001
3670
8780
4852
7609
21072
3074
6220
6464
17260
13133
17016
3113
14299
13585
13939
18193
11283
17351
21159
7865
15533
14826
2491
18031
11871
6567
263
2390
3557
3225
7110
3237
19659
19580
20139
20056
8065
19149
1892
7059
20913
16325
14402
8896
19873
18550
9867
11906
5244
14653
11074
18231
6621
19892
7807
13100
12206
9219
4405
18750
8699
7234
7210
17082
2843
17839
12321
7558
13241
15959
1867
12216
6208
12633
15722
3743
13701
17431
4910
10924
3467
754
7331
746
4322
15049
2373
14489
2527
6591
8318
13307
10166
13289
2884
835
3104
18418
9299
18419
4371
8022
2744
216
13295
15847
16397
21061
14967
12400
14802
4619
2272
191
13581
4242
161
226
2218
11147
1763
13820
8422
5456
17447
20042
2467
18870
7425
8101
20686
10667
14024
2534
16761
16583
14990
16136
7163
6125
6332
7445
16998
10566
3124
14075
15056
12088
7923
5073
11465
852
9617
13334
3396
1324
3151
21000
6743
20585
5447
17639
3941
11926
6455
4687
18897
8611
20948
14865
16724
12481
1870
9191
19095
11037
13527
15772
4696
18927
19521
18760
12925
5106
14800
1695
16690
2875
12439
11113
33
6771
9116
10340
20773
14097
15479
7566
12149
9898
18115
16589
16487
20125
11120
21088
10918
6266
14356
20051
9002
15948
13044
2146
8245
1374
8235
20029
7091
6113
14184
13716
14155
7738
18546
20642
17244
1730
2468
3146
17056
3190
20864
1355
8623
547
8486
13107
19361
16765
6875
4227
14543
6076
21020
9359
19345
18164
17734
795
7777
7618
3727
8668
18527
15768
7520
17261
15112
8939
8728
17342
5876
3942
8490
18903
8807
15723
3407
8069
19430
4567
1138
20981
1577
11836
18601
20149
4332
7037
9100
8851
9321
19501
528
9995
19663
8931
12889
19437
13032
13202
3509
2917
10331
9379
4610
5289
9206
9528
7922
399
4337
9786
8212
19308
6288
18207
19300
8159
4
6557
10964
15425
9106
4951
11423
6819
9372
1144
6342
10020
15488
19118
227
2339
855
1468
3096
8089
15144
17307
16621
2581
3066
5248
3051
1899
2458
20801
251
4828
2018
1666
8328
4904
14381
14389
16421
12300
2190
15931
7374
1954
4514
4802
11525
5873
313
5297
10151
11104
16756
70
15703
8737
2496
5732
12669
19271
17737
8308
19693
8438
2596
8947
12554
9132
614
10726
1359
13410
10734
17906
10094
5110
12639
16117
1341
12790
14823
2005
11364
15617
704
19848
12067
9138
7084
13748
16502
18192
3529
19319
17088
20526
12891
15554
167
753
18491
6451
2833
20013
2907
10110
11776
12543
17368
16517
566
935
21109
6782
13331
8312
2353
8096
18396
9430
14067
6146
13251
7355
11901
14263
8527
5235
2303
14167
21134
1507
8359
797
21191
3089
16657
14561
15987
275
13047
15336
16411
10688
7200
5686
11615
1744
6374
17167
12952
10876
18696
14663
13024
11238
6241
21179
6532
10287
4521
16433
19086
2166
20853
9877
11649
10728
20287
12977
20933
7572
18678
5831
6354
18075
9264
20980
20576
5079
17762
9871
1979
11535
5999
11976
8894
12670
21017
12802
2255
20022
3779
3800
2506
6683
4135
13901
9198
6261
17661
1779
9760
19743
6158
11925
17180
10154
2740
17739
8997
7001
4283
20754
18338
5977
18431
18440
14194
3761
3358
18464
14256
17371
3637
131
20344
16787
18321
16516
4433
17670
8783
14151
5552
7036
18074
11820
11497
6368
2394
6082
8963
6259
6064
17071
515
2382
8155
4694
3628
10371
6014
7530
3330
2204
3233
1548
16443
105
5066
16666
19680
19031
1879
20430
4446
18383
7485
20610
2739
10812
6797
14927
644
337
18531
1125
10227
1471
13282
6904
18281
4501
9494
6118
10784
19791
13754
10862
6194
17397
10084
3925
12857
12886
3346
11307
16930
16265
20974
8499
21148
19605
7353
9821
16630
13739
18841
17107
13730
3040
14554
15926
6267
8457
15621
12338
13454
19396
469
16726
13364
15792
20075
14899
4165
1652
11243
3293
18497
14809
20889
18844
20434
5184
7220
12022
19906
19822
1888
19063
16269
9484
6155
10232
9400
7284
11957
9956
7645
5807
17426
6489
10176
20367
8992
20766
10245
7466
6664
7594
12201
17038
7819
14124
3106
7260
8886
11127
3681
14423
6545
1256
14386
11210
20486
11097
618
20655
727
328
9474
7753
1477
6450
17163
15204
20512
14578
14015
2002
19428
8100
12109
6420
20506
8798
18123
3750
9168
19009
5210
19106
5402
18796
11983
20210
9413
4705
729
18745
6638
6503
9237
8758
17819
16442
8166
1486
5123
5994
6955
15420
12247
18883
13054
21149
7957
351
10169
11762
14043
5290
4825
10505
6917
3254
3175
8329
18889
20197
18336
383
15255
13832
15564
3903
4005
387
5370
6218
1381
4039
12235
10448
8310
6998
6392
15911
7720
14260
13276
8323
20455
18095
2423
12212
2944
20228
8293
20043
14017
7614
9078
16548
1746
12432
10687
15303
1851
11227
3393
20791
10101
733
3317
6517
19787
17147
6469
7729
19177
20718
17073
20720
6370
13421
10439
4373
19854
8784
19660
9759
10892
14616
3364
15853
15790
9823
1609
2265
12719
9991
211
15800
2020
7029
14073
665
20140
18671
11706
6232
15459
9200
3995
16779
7503
10475
14105
3432
9542
12271
1175
8914
653
18549
7877
16296
13052
4516
12229
11585
11258
14886
13222
11064
12428
20320
6928
5530
7108
14311
2879
9073
10187
16000
2777
20232
11835
6281
1333
16114
5814
13660
11528
4468
5336
20698
6518
11044
5386
10780
3694
18465
17573
14335
18035
11049
20990
6637
1238
13880
13011
7480
18579
4884
7285
3956
13252
4351
13337
587
6900
20551
1728
14111
17195
19217
14297
630
14852
8990
12038
1461
9352
8519
12793
18302
655
19954
21111
2737
3836
13290
20490
18245
9869
12549
9541
16785
16430
5514
656
4738
1463
8062
5501
658
13872
17318
355
142
11502
1127
21087
18402
12949
15829
8825
20142
15245
18416
12689
11745
12365
20563
16191
5803
15992
17979
10917
388
12694
17873
6359
20443
16896
3021
2542
6215
9246
375
9038
19363
14406
20361
20536
12575
15006
4115
7624
4915
11259
11480
1783
15581
1156
540
6430
2719
16146
15659
5451
11575
5310
7075
14139
15314
20196
638
12945
14267
13240
16048
19698
10776
4611
17356
18963
19953
13637
735
18557
8543
4033
1164
8708
4341
7792
19125
8136
9633
6660
2407
17538
7402
20394
13893
17278
7238
11294
2004
10443
9615
5349
12371
10058
14276
12198
20334
18390
16292
8300
13691
6693
19236
16736
13215
14473
6251
7107
21169
867
7608
8439
3065
18392
4299
14426
16700
2420
8562
1792
8236
20908
548
1936
20004
16835
19246
7066
18420
5070
16251
10033
5742
2299
8102
2029
8401
11627
5684
10484
14754
1928
6472
16918
3077
1487
7712
6678
17604
11234
2829
17106
4958
10519
803
12862
6696
5109
16695
21102
8482
8117
17169
22
6726
15299
10984
14549
18188
7422
19265
9972
18229
3765
8845
9016
19338
1234
12528
6690
18258
15046
15522
752
11129
9803
10006
7055
9663
1296
5764
564
7527
6558
16996
17625
339
6020
9777
17862
10202
13037
11907
18352
4105
10067
5465
19949
19032
1575
18843
18062
12231
13764
10321
12027
18951
9971
17774
7817
17995
3634
6415
17321
8667
16619
916
13103
11950
16482
2501
20260
19343
10172
7972
18611
17299
4199
14042
14003
5993
16562
2783
18181
9735
3064
13225
4759
5765
18441
645
16926
11753
5247
12510
7054
18162
2669
19267
3242
12434
8339
11523
12274
5673
4345
17133
5074
12556
10849
15770
10311
1929
17780
10056
20000
11590
12720
1441
6881
1638
1787
917
2942
3623
3247
15548
2137
18895
9753
6544
16333
7266
3298
10402
8700
16804
349
15954
4650
15834
20657
370
7341
10543
5284
9594
20371
15247
6627
20159
4542
15803
7732
668
18408
12021
13070
4920
6813
428
20762
13944
8335
3707
9223
16917
4831
1975
1314
7883
5352
18046
12585
13508
10344
530
10885
14445
12973
17329
6616
15701
12136
563
11226
10171
16240
13072
17668
1624
3280
18421
15156
21058
21026
11868
18500
17676
14885
18944
5459
9317
10723
19606
16245
3325
6899
11521
15062
10208
7126
2156
19884
1248
2623
9415
340
14751
17179
189
4865
5275
14076
18299
12236
12189
201
4040
1221
1131
10277
11758
19492
4082
16403
3618
2612
5303
10968
15175
20481
9189
10195
17358
20407
3207
20632
16909
4552
18907
8850
16161
7540
17396
1399
4498
551
19611
3261
2918
7559
18892
1185
20663
17037
12341
7109
3090
21104
17018
18244
6918
6411
15904
13452
8870
20914
21192
8060
17877
856
19505
18017
9558
15044
7089
5542
7604
101
16091
1290
11408
14007
20567
18052
15894
8600
13881
9397
20104
10021
19947
20432
12573
5886
14597
19318
19364
13747
13498
10367
1875
19666
20825
19010
5034
2815
13463
9648
359
14354
11959
14699
3053
3035
13777
15634
242
14730
16837
4782
3764
20987
19058
673
13962
1484
1370
8049
1427
4962
5416
8658
11805
12483
18664
17069
12810
85
2590
3739
14603
40
5773
17844
13450
4620
13949
736
13126
4955
20543
19044
5825
9363
14955
21143
8899
19764
8003
8566
9681
902
6965
16013
1429
7946
7714
14813
5326
12346
15631
18698
12803
13840
5476
10162
12491
10209
2112
17157
14964
9986
5915
8450
12447
20905
1265
11293
14776
7275
12498
6275
7960
6510
20748
4484
16448
4367
11375
10875
4898
17868
13485
5419
8198
789
4401
849
4051
15442
5128
3078
19273
10153
7381
10502
16216
13732
9313
10168
5570
21064
5182
11321
16563
19519
8741
15099
18161
7564
14275
9018
2133
13352
3230
8629
15819
7815
10911
13515
7291
1579
9137
13827
14188
19911
9502
7948
17375
15008
21185
13793
20395
3696
18680
5196
15337
16734
7836
919
7325
1757
10568
16360
8327
6508
7653
3493
3902
2870
4159
7582
15169
8508
8855
8966
2831
14154
17895
5398
8109
15327
15943
16511
8139
1799
18209
5429
674
9587
5914
4762
20498
4431
5758
20457
13617
12713
2505
6391
13408
20638
5178
21021
1412
14639
18273
20510
7517
13809
10319
8063
13555
14972
5794
20606
5580
12143
5358
6945
3102
10375
9394
5650
6537
4286
2178
11035
6413
14710
17968
11844
18217
17335
1921
13818
4991
5159
5321
1403
12809
3196
1862
3571
20658
15905
1778
1349
2842
19993
1334
14382
18170
8729
5988
17498
13974
6617
20807
13977
18681
19986
6108
11955
471
6867
16774
13113
16319
17273
14928
13233
3502
5039
15253
11897
385
7357
10286
18
3664
18287
144
18021
15115
7774
2484
10350
9520
1034
4335
9964
9320
20345
18105
19990
13628
5355
21029
10781
13885
18240
2594
7900
17852
20025
17558
7717
9526
4268
8398
5727
19945
7536
6424
12536
20598
18061
5464
18972
18667
8878
15907
5645
3671
3058
3361
17977
13111
9366
14411
7505
10034
19098
9194
21175
12678
7303
7457
18182
10514
8622
3506
8561
2216
19621
16838
12730
8480
7242
3944
15787
4823
9973
5963
3039
18960
4222
3054
19463
492
19050
9797
377
276
10785
3931
17942
19462
995
15818
6924
16221
10102
3413
4170
6784
8259
20676
7589
2287
3404
4031
5637
19380
12342
18224
20473
9899
20574
6934
14116
13456
324
2706
8436
15357
10725
5689
20553
5544
552
4839
13613
14982
8326
7006
18151
3451
8018
20534
11349
9197
13207
1924
4397
1458
9464
7898
4297
11279
12732
14682
8207
19701
8645
6926
1231
5692
13583
9059
13892
10414
1704
18694
11797
16249
8871
12921
7470
7187
4162
20637
384
9245
14602
7071
12248
11481
13911
12205
6759
15643
5144
1449
17881
3378
16361
8655
15750
11850
12395
6885
1350
12845
2784
1593
20409
576
11175
13874
17054
16963
13567
4359
16741
19280
21217
19495
20838
10652
6296
16303
16462
20280
7880
20297
13486
5134
4018
7838
5709
9798
86
11587
8184
8782
5725
7562
14337
4448
18912
9440
4262
817
15494
11002
15440
14117
3334
11683
17419
10913
918
6580
210
18261
10308
13234
11672
3438
17526
14881
4993
15685
2476
14457
16484
7856
13995
2205
6027
10708
17012
15360
7730
9868
555
14347
846
7655
19176
14687
15150
14509
8898
2371
9284
16856
16903
21218
6948
14458
3755
17584
20925
3766
15113
12290
18296
20781
8599
10739
2488
4147
1672
3585
2474
11008
15250
21114
7872
10009
12668
20041
15589
15826
14863
15906
20934
11513
4377
16525
16641
13894
16836
17617
8955
20545
16891
5738
2290
6855
19633
10795
18502
1903
5265
14342
17948
11045
20335
8264
1192
631
10909
2599
9822
17482
9934
5609
16564
3698
13071
3998
9842
8185
1267
14453
8837
703
10314
9814
11286
8357
14539
2030
7606
17962
9188
4154
1473
8449
17952
16039
19045
15809
4326
20880
15444
11855
5307
19325
18855
15378
15368
20089
21099
13074
17954
16994
13900
19143
18842
215
17941
10680
12322
19809
7352
3347
7416
15013
7534
18311
20988
20772
686
10988
3075
6409
5615
20491
307
10737
21119
1805
6942
6952
14235
20702
10715
12986
12461
14418
3554
10031
8463
15162
20289
14186
3636
483
6324
10981
8827
9282
1301
17239
1140
19518
9691
12407
3551
4827
18043
17232
6847
7471
18832
11569
5118
6141
561
3180
842
6159
11953
1289
5387
8434
12767
1165
10348
16798
20993
18154
10527
13447
7808
10282
5869
5033
7185
9304
19718
18821
14628
16097
6933
12113
4930
20386
20008
6097
15000
15107
12296
14333
15024
11923
14026
1320
13917
16780
2412
6989
12293
16711
9011
6861
2793
5817
5596
338
3685
4628
19069
2583
9978
2478
15361
8265
10804
12367
2040
17293
18761
5554
5947
8666
7045
5431
7625
7871
15143
5752
1994
5735
19314
13212
5867
20504
4565
13446
14613
11987
2327
11539
1662
19555
16627
20117
11272
14160
20712
4608
16244
2341
19395
1095
4676
6862
3406
19490
10335
10735
9586
3270
20873
7295
908
20399
17590
15419
9216
550
2769
19510
2904
7893
1066
10731
13812
17376
1141
12854
4384
12460
5937
15539
13227
6100
14364
5240
4479
294
2627
3648
20034
16279
18116
16676
9222
17394
6154
534
13169
11087
18936
9838
10471
759
4148
11125
334
9640
5723
11809
18935
2472
14573
10001
18435
6404
19349
13253
808
1678
20820
16382
15970
18606
8594
5855
7680
13312
16770
20775
2388
17865
3013
1446
16334
12132
8849
12685
10802
14598
66
2901
3688
16990
9711
18189
11267
9938
8362
6506
18654
10743
2017
9103
37
17382
1927
11152
409
20389
2509
18809
16544
4053
18751
12208
12265
21116
10709
6509
7926
14339
20943
8754
10353
20835
5230
21162
1121
1153
17214
12895
5148
17052
5030
2061
5455
4102
367
10220
13237
1122
11711
12598
16409
13766
20852
11466
7947
13796
2176
9702
2024
4006
7524
9213
1017
4187
17451
6795
6179
16134
15972
6796
10391
7699
20810
2708
17343
3329
5590
20084
2809
13461
11429
2000
11608
418
5376
6589
4647
10409
5212
8603
19700
3428
14891
14550
17212
11763
19891
20944
14905
12852
972
21076
151
4950
3542
13209
2622
1300
2056
5174
6783
3932
2653
19372
12900
8627
9026
1338
15472
6864
15613
12259
2785
9044
2421
15129
12174
6515
389
13908
12078
90
1137
7138
9131
17726
8282
17282
13042
4761
20133
14443
7023
19722
16989
20377
10542
20087
3392
18735
12340
20631
13017
6206
675
6731
202
14926
18169
12684
14559
1190
10045
4129
9365
13797
4675
3984
19254
4348
14217
6788
21073
14108
5922
19435
4587
8556
7385
20597
3994
9424
19940
10978
20471
16290
12637
837
5019
48
8454
6175
2271
16557
10942
2060
87
20904
13676
17548
4775
5351
577
10614
13118
6605
1967
4358
3972
14439
2968
7099
11905
12453
17511
5282
1720
7568
11392
11676
5055
13891
5569
9493
2806
7719
20461
7998
13226
5180
11440
6527
18831
217
17918
11739
6355
5037
17340
1795
3276
2549
8380
12548
1943
3990
2610
10458
14786
15201
18176
17845
20778
7619
4486
6490
8865
18366
792
5433
15665
11597
20438
20474
7016
15544
19777
11427
19751
18749
7390
9813
19471
8066
11619
11573
16954
8589
14892
19748
3527
18565
246
975
19137
8431
14932
8802
19002
18615
3172
14849
6935
12051
12032
2562
12771
7223
7676
13357
606
17728
2994
11510
16932
831
5124
10732
11462
16599
16252
2050
17201
11315
17696
19922
6536
10700
17450
8656
7546
10843
17300
2307
16280
19442
21123
9926
21054
9544
1537
20571
798
14173
9564
15399
1574
13213
18668
19820
2838
9773
12225
315
15654
12656
18573
881
3741
21036
16729
1698
14563
3314
2475
4424
21079
16209
3848
7939
20185
8007
5199
10164
20493
16667
14500
2865
17117
15766
758
1291
13622
660
6629
3369
16187
16592
67
761
6328
6358
8045
901
6031
7698
15448
16365
6295
14178
11223
14697
10238
4895
12820
10889
13656
9671
4068
6800
8677
1797
3311
17672
13112
6579
13752
13216
18933
7209
21033
16170
18539
9714
6323
5130
1243
15530
18697
3241
6912
7474
20558
15721
18468
1150
3055
15328
14655
11048
7775
5473
10436
1490
18644
20467
20578
6289
10916
15780
16766
652
20337
7233
17373
18145
9090
13137
10097
18078
16602
8864
3417
13292
15664
9682
11550
14189
9212
3149
6962
11131
1282
2589
16380
18417
17901
92
2386
17746
17367
12153
4179
9287
9794
6727
19038
11956
20184
1298
17889
11362
14131
14678
16823
1211
11618
19575
13605
20960
19145
17669
9756
12567
5606
5968
8451
20896
5088
9672
20885
2602
1413
9384
19096
15185
14819
1588
9431
20214
9288
9048
8774
19704
3030
6438
8901
2766
17566
14028
17172
17112
5824
11829
18472
8879
2684
6311
20888
2301
15392
9539
10108
4233
4461
11280
9738
20671
4885
11681
13505
3606
1136
11526
14150
3818
19711
18478
874
14210
9331
12600
20065
16573
6982
9324
5334
8161
600
9356
19533
7324
7103
18533
12580
7746
11916
5087
2846
20845
1926
10066
12457
14040
7919
12763
8890
8559
3103
21095
12074
15223
5804
8493
543
11095
18556
4232
2259
11297
8372
945
9618
8953
18676
4966
893
7256
20784
20294
16310
4438
18877
10274
20405
9459
20458
13683
8232
1217
7393
3159
6169
19799
5061
2919
34
4458
14438
18476
18608
17503
7011
8555
10499
13144
8082
11643
348
14159
20153
20003
5726
9658
10380
19088
2123
5347
10434
15229
5059
5943
7297
20771
279
20533
4327
13099
13397
9057
15660
12095
13401
969
7267
2780
19688
1808
1957
1382
1987
16465
2429
17840
5535
3975
17277
7496
14787
7327
14725
7321
7052
1339
20447
17757
13768
15830
5700
5251
3477
12704
9289
15057
15842
1601
16451
12288
17778
13621
5044
11237
7263
19136
16981
10128
3401
985
14176
12277
10721
19405
15241
358
15434
14898
17317
15763
9929
11282
8722
12741
5608
20205
17288
491
2502
6053
2316
12040
14861
1235
12409
14619
20530
7375
16743
2845
1179
1540
4977
17974
10766
3117
14241
11201
7602
15998
424
5392
7734
13178
13869
12398
18404
11817
14103
12188
1912
16813
1331
5482
5421
10509
5978
20392
10433
14269
16437
5274
8098
3245
9114
5449
15351
14510
6476
4596
20844
1923
12624
17001
6577
8369
2794
19926
12966
7711
460
18023
5286
4914
11970
13807
15203
9491
20854
20538
15536
15858
5992
7514
8593
15123
16461
9025
5746
815
2666
14665
8695
15450
3584
4023
7560
21193
9965
17462
17231
7537
17236
5167
19173
19839
9944
9924
20188
988
1599
10423
10119
8577
16370
3561
18899
1018
12672
15146
10629
9858
4612
19849
17946
18939
15961
724
15743
2033
341
16638
14482
10581
18774
3639
15095
10271
25
7150
7736
5926
13985
17994
16165
15237
11705
1372
15786
6767
2564
2079
14512
11939
4459
2858
13790
20416
10310
2387
15075
17495
8221
3004
2471
7913
9516
7891
11852
12191
7961
3879
5346
13864
17925
11571
3550
15909
19047
12352
13138
2921
8170
2120
5833
18738
9974
5364
2194
9598
535
1261
15292
1442
1764
4835
18534
19869
1108
13182
20626
14314
9419
8779
9205
7004
19967
17991
4447
16855
2718
20459
4660
4982
8826
6029
10488
2963
1084
17892
17303
1833
19614
76
20021
3206
18756
8348
8016
15191
12258
4760
16210
1001
20403
1789
13675
11448
3093
14369
15778
3436
18516
12334
13405
20078
4152
13824
16413
14122
19874
18213
1621
1139
21136
18846
16916
20744
15730
2096
11572
20462
5835
15919
10834
18190
9255
18143
12221
926
20055
8046
11371
1675
17554
12729
1052
237
10539
13063
18879
1344
4638
19327
8607
419
10275
20116
13187
9892
14066
8636
14624
21018
3892
18315
7005
10646
19526
19589
13115
5783
2854
44
6675
2368
9069
6178
10218
15265
9235
9662
10329
9454
8749
8091
6149
8237
9841
203
17270
15680
17563
14570
10493
4787
14016
19855
15003
7978
14694
3699
18588
4069
16094
3315
9746
9611
7095
10260
13057
14593
2141
616
3792
6085
16985
9337
6937
13740
9151
9883
16025
12401
16982
17247
11054
12950
8346
18868
14380
9122
763
2198
10373
14179
19650
10327
7039
8948
18367
17067
21
15400
6761
692
12197
4953
14866
2570
4412
4724
10028
12738
18884
6230
18359
16708
5809
5585
16650
11641
3774
661
16935
8190
17454
17828
1977
4256
5845
413
6582
19017
12709
20479
950
17412
18364
330
2318
10567
3952
16642
956
1197
14399
6745
11063
21198
8537
11574
17210
6008
8351
17205
599
750
5973
3236
8916
963
11729
19826
2184
2734
10358
17571
1187
15447
14856
20805
2631
4728
19253
11163
12438
14234
8848
7072
6719
19924
2193
19317
10046
9373
249
8592
4731
8368
1513
11788
18610
19030
20525
14758
9149
12920
8716
10887
14781
20227
13738
14238
20329
3307
10112
12045
4983
9110
17267
5823
17471
264
5924
10574
14
13344
342
18010
12345
10681
7788
2192
4748
15658
907
4934
3702
17810
6665
5502
10896
14827
18721
17760
16740
5406
12260
19948
13174
20083
271
20285
9387
800
5954
14853
15151
15439
17621
10929
12625
14600
4307
5567
13349
12152
12217
3469
1099
5077
11416
20484
8462
6915
14700
12506
3687
7078
11076
14420
4488
7639
1689
4721
17257
2691
15922
4259
1483
13943
19637
20069
9303
10130
5450
9848
13763
12907
5644
3602
5849
7361
9894
20814
9853
3326
10295
19488
15749
13566
8974
14707
3148
757
4711
19844
17694
12893
14444
2174
209
2951
17196
18399
7511
373
3239
10131
16840
4582
19128
1270
19562
20706
16609
5443
15824
16316
16464
1800
183
17614
11141
13883
18651
15764
20241
7028
13012
6898
5494
1804
9785
382
17036
300
6513
8548
6129
13005
12770
9524
12408
1863
1247
18483
9913
16567
1645
8140
3512
5095
4817
1472
6418
17856
13625
1556
9381
2443
15183
7113
6534
3344
2431
2013
16324
19915
7044
6356
12199
10722
17078
11722
3045
11492
6403
5972
19037
5864
7801
8127
11058
36
13478
12485
13572
13816
6949
19099
13522
4504
19313
19104
2254
14872
5239
10779
10676
3851
11606
2804
1752
14835
19263
627
13687
1529
9462
13380
626
5168
6045
8830
18945
14505
1174
20001
17062
2044
9817
1776
6612
17689
16011
4996
13350
14929
3262
15296
18407
13896
2480
16130
12953
1553
10653
16453
9562
10182
6143
9478
12959
2395
6529
8461
4231
15466
11827
8196
8857
15708
20615
8295
5331
9787
3595
15845
2252
10280
11262
9190
20898
17481
9889
3138
13769
3955
16402
13557
12436
14941
14470
5900
4989
529
15584
12650
7123
18195
11665
18197
21022
17357
333
5218
1106
15121
4146
18175
4994
9604
21050
4277
10417
17519
12192
10778
6387
11463
1842
3718
1157
1145
7695
18237
321
7944
9482
5840
11285
12996
15632
10612
17081
17543
9185
6684
19005
5437
20154
3497
13787
15553
8285
12187
11811
2381
13921
4562
10833
11918
3775
20848
10464
13235
1503
5591
5874
5654
7441
10055
376
3644
7247
15122
15356
4572
18118
16593
1080
20995
7281
18959
12574
3016
15883
12868
858
16894
16230
18957
12535
14574
17890
18825
12085
14008
12368
320
1249
7644
18548
10782
11195
97
10633
168
6101
9142
3017
13069
3494
5152
7368
2298
11532
12355
8634
13348
4207
15383
9036
11636
11693
11240
14306
3523
14614
9776
10221
17821
3653
5158
9453
1224
12539
18783
17743
17569
4340
2389
18773
7299
15487
4622
11985
7779
4477
18636
1932
7376
5942
7159
4306
2567
14436
2376
11626
3100
3587
8633
21206
5149
8959
13365
18064
9
10183
9647
1476
11741
9370
18768
10914
20113
4270
10513
15333
4269
16144
7702
14365
18513
9128
10026
5260
19114
4602
9058
14101
4020
6679
5389
19652
7674
17455
9550
3610
19737
5249
2249
11660
1758
18013
15277
3756
3598
16504
7257
11213
2529
19235
17843
12914
18602
7761
16218
1734
369
13090
3371
16501
9174
7476
11632
17891
8535
5413
13210
8793
3869
17758
14889
11189
7048
1542
4478
7383
4047
17610
9781
12707
1874
18235
5200
4402
15603
4319
421
13418
16960
16883
18369
1742
13624
20173
1878
9736
4012
9328
3700
1505
15587
5411
15485
20660
18519
5539
8654
17847
20018
8
1469
13375
3115
5278
15952
5166
2786
6122
17224
20697
18864
14048
15117
1327
19150
16256
9302
9891
7086
360
2435
12621
4444
8767
6009
6648
16175
20466
16673
2579
6140
9340
4301
920
18876
7772
14968
19928
6932
14750
1240
732
10622
13347
4854
14894
15839
18684
5361
10095
16053
7491
726
14057
9395
7810
5214
13329
10952
13992
9439
17207
558
19999
1949
14794
2441
10906
305
14060
16624
6584
8015
11519
17567
2461
666
1160
2972
15902
909
3412
3147
14494
16556
15506
10967
5751
2165
3790
6019
2848
3139
10303
15353
17383
12084
6043
8930
4469
17869
9218
17663
21043
20949
20785
10125
4842
20768
13059
6381
17226
13879
4240
15118
6412
16344
11534
8477
5965
14734
9837
1313
15224
10508
19756
7280
17781
19227
18309
7332
1607
10184
17442
20122
4692
1242
17528
11460
16538
9124
6597
1207
15532
4589
17199
7431
7145
2129
17652
6073
3974
7595
782
14296
10292
11370
4366
14690
21008
11898
5183
4699
5658
8768
5694
10392
6611
14187
21015
18926
3763
4945
18990
13913
8847
12764
6859
7858
17521
20092
16342
53
17989
8922
3136
3810
14987
10810
18547
8388
2910
8706
15520
19008
19950
14424
3057
13041
17479
18461
6685
11857
7557
6671
15318
8414
14757
6773
4474
1902
3269
4510
2014
7822
5484
14976
12999
19944
15866
1858
16124
3455
15067
2536
16572
4593
20231
12697
11042
13854
12612
16051
8777
19191
6340
5133
8861
4071
8158
9341
10372
12976
10290
17564
8291
17333
20237
9570
5715
2582
15619
4887
17931
17003
3109
4580
10418
18307
1930
14689
19109
1697
18471
16297
19052
21057
17290
6264
6213
9844
11372
12442
465
12786
19574
7261
19007
5221
16594
184
16148
6035
17937
17061
11389
5582
8073
16760
4656
14732
18410
10878
8681
1510
15319
18434
1766
17216
7691
4801
9659
16515
15176
1013
14830
12396
10266
4158
4807
7365
12102
21007
1319
20010
21014
17533
3012
15009
17654
16680
6833
13259
4328
4658
13848
5623
13346
9764
3874
20264
4239
2214
2032
10874
21002
4014
16017
16388
19188
6504
16625
15727
3229
15366
20319
19203
14390
14617
1572
18141
365
8286
9602
14372
7954
5690
13201
12898
3223
11088
21181
15433
1919
2577
993
12876
978
7768
11524
10561
19672
12568
4141
6383
11013
20554
11318
11607
8072
3042
17876
7642
7542
16713
10760
2864
11212
1329
15876
18451
21180
7991
2588
2049
12516
18104
8917
16685
6561
120
14986
16565
6339
6493
11620
9265
7615
5388
14919
11217
609
12166
6531
13806
4657
13297
20872
3787
9129
3352
9632
12161
13984
14797
17294
20053
448
16311
2878
6369
9224
10441
11235
8764
9021
15592
2523
4626
6078
18428
10900
18223
18824
13255
2346
13453
10837
16524
18033
11411
13488
19079
2292
20633
18184
940
773
20155
16385
20535
18477
2754
11337
2587
7728
637
4111
3547
18975
14328
3067
3870
14037
15528
20445
16532
20422
17518
8157
8938
16978
5796
